RANS_1D/channelFlow395K_EPSLS1D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1335 0 0);

boundaryField
{
    top
    {
	    type 		fixedValue;
	    value		uniform (0 0 0);
    }

    bottom
    {
	    type		fixedValue;
		value		uniform (0 0 0);
    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

     front
     {
         type            cyclic;
     }
     Back
     {
          type           cyclic;
     }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
