RANS_1D/channelFlow395K_EPSLS1D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 8.98e-08;
boundaryField
{

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }


    bottom
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    top
    {
        type            fixedValue;
        value           uniform 1e-15;

    }

     front
     {
         type            cyclic;
     }
     Back
     {
          type           cyclic;
     }
}


// ************************************************************************* //
