RANS_1D/channelFlow395K_EPSLS1D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 6.68e-05; 
boundaryField
{

 inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

     front
     {
         type            cyclic;
     }
     Back
     {
          type           cyclic;
     }

    top
    {
        type            fixedValue;
        value           uniform 1e-15;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
}


// ************************************************************************* //
