RANS_1D/channelFlow395K_EPSLS1D/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat csv;

sets
(
    verticalline
    {
        type            lineCell;
        axis            y;
        start           (0.05 0 0.05);
        end             (0.05 2 0.05);
    	//nPoints		30;
    }
);

fields
(
    U  epsilon k
);


// ************************************************************************* //
